Fabric Sheet can be placed only in Structural Floors and straight Structural Walls.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FabricSheetWrongHost { get; }
  Visual Basic
Public Shared ReadOnly Property FabricSheetWrongHost As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricSheetWrongHost {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FabricFailures Class
  Autodesk.Revit.DB Namespace